In [1]:
import pandas as pd

In [27]:
cv = pd.read_csv("/Users/abhishekrotti/Desktop/Python for DataScience/dataset 2/train_set.csv")

In [28]:
cv.head()

   visitor_id                                             visits
0           1   30 84 126 135 137 179 242 342 426 456 460 462...
1           2   24 53 75 134 158 192 194 211 213 238 251 305 ...
2           3   51 143 173 257 446 491 504 510 559 616 719 73...
3           4   1 20 22 92 124 149 211 335 387 390 406 460 48...
4           5   34 51 56 106 110 121 163 233 266 275 345 359 ...

In [34]:
cv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   visitor_id  300000 non-null  int64
 1   visits      300000 non-null  object
dtypes: int64(1), object(1)
memory usage: 4.6+ MB

In [35]:
cv = cv.rename(columns={" visits": "visits"})

In [39]:
#converting the string objects to meaningful numbers
visit_list = []
for visit in cv['visits']:
    visit_list.append(visit.split())

In [42]:
cv['visits_num'] = visit_list

In [110]:
len(cv['visits_num'][0])

26

In [45]:
del cv['visits']

In [61]:
cv.head()

   visitor_id                                         visits_num
0           1  [30, 84, 126, 135, 137, 179, 242, 342, 426, 45...
1           2  [24, 53, 75, 134, 158, 192, 194, 211, 213, 238...
2           3  [51, 143, 173, 257, 446, 491, 504, 510, 559, 6...
3           4  [1, 20, 22, 92, 124, 149, 211, 335, 387, 390, ...
4           5  [34, 51, 56, 106, 110, 121, 163, 233, 266, 275...

In [102]:
new = pd.DataFrame(columns=['visitor_id', 'day_visit'])
new['day_visit'] = cv['visits_num'][0]

In [103]:
new = new.assign(visitor_id=1)

In [104]:
new.head()

   visitor_id day_visit
0           1        30
1           1        84
2           1       126
3           1       135
4           1       137

In [105]:
new.describe

<bound method NDFrame.describe of     visitor_id day_visit
0            1        30
1            1        84
2            1       126
3            1       135
4            1       137
5            1       179
6            1       242
7            1       342
8            1       426
9            1       456
10           1       460
11           1       462
12           1       483
13           1       594
14           1       600
15           1       604
16           1       704
17           1       723
18           1       744
19           1       787
20           1       804
21           1       886
22           1       924
23           1       928
24           1       946
25           1       954>

In [126]:
week_no = [int(day)//7 if int(day)%7 == 0 else int(day)//7 + 1 for day in cv['visits_num'][0]]

In [127]:
new['week_no'] = week_no

In [128]:
new.head()

   visitor_id day_visit  week_no  day_of_week
0           1        30        5            2
1           1        84       12            0
2           1       126       18            0
3           1       135       20            2
4           1       137       20            4

In [129]:
day_of_week = [int(day)%7 for day in cv['visits_num'][0]]

In [130]:
new['day_of_week'] = day_of_week

In [131]:
new.head()

   visitor_id day_visit  week_no  day_of_week
0           1        30        5            2
1           1        84       12            0
2           1       126       18            0
3           1       135       20            2
4           1       137       20            4

In [119]:
new.replace({0: 7})

    visitor_id day_visit  week_no  day_of_week
0            1        30        4            2
1            1        84       12            7
2            1       126       18            7
3            1       135       19            2
4            1       137       19            4
5            1       179       25            4
6            1       242       34            4
7            1       342       48            6
8            1       426       60            6
9            1       456       65            1
10           1       460       65            5
11           1       462       66            7
12           1       483       69            7
13           1       594       84            6
14           1       600       85            5
15           1       604       86            2
16           1       704      100            4
17           1       723      103            2
18           1       744      106            2
19           1       787      112            3
20           1       804      114            6
21           1       886      126            4
22           1       924      132            7
23           1       928      132            4
24           1       946      135            1
25           1       954      136            2